name: "text_normalizer_pipeline"
backend: "python"
max_batch_size: 0

input [
  {
    name: "TEXT"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]

output [
  {
    name: "NORMALIZED_TEXT"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_CPU
  }
]

parameters {
  key: "FORCE_CPU_ONLY_INPUT_TENSORS"
  value: { string_value: "yes" }
}